# HW1. SQL Basics

## Objectives

In this homework assignment, you will use SQL to store and query a database. You will learn the followings:

 - How to create a database
 - How to load an available database
 - How to create a table 
 - How to change a table after creation
 - How to insert data into a table
 - How to select certain rows or columns from a table
 - How to join two tables together
 - How to use expressions

You will also use [SQLite](https://en.wikipedia.org/wiki/SQLite) as the DBMS. In contrast to many other database management systems (e.g., Oracle, DB2, and SQL Server), SQLite is not a clientâ€“server database engine. Rather, it is embedded into the end program. This unique feature has led it to be adopted by [billions of applications](https://www.sqlite.org/mostdeployed.html). 

This assignment has a total of five questions and 25 points. 

### Code style
No penalty for bad code style but it is recomended to use the standard SQL style https://www.sqlstyle.guide/

## Setup

You need the same initial setup as for the Interactive Session 1.

# Questions

## Q1: Create a database (4 points)

The goal is to create a database to manage student and course information in computing science department (named `cssys`), and then create three tables in this database. The first table is named `students`, the second table is named `courses`, and the third table is called `transcript`.

To start, please execute the following cell to load the [ipython-sql](https://github.com/catherinedevlin/ipython-sql) extension.

In [2]:
%load_ext sql

1.1 (1 point) Create an empty database  named `cssys`

In [4]:
%sql sqlite:///cssys.db

'Connected: @cssys.db'

1.2 (1 point) Create a  table  named `students`

Please create a table named `students`.
The `students` table has six attributes: student id, first name, last name, age, gender, gpa:
* `id` - integer
* `firstname` - char(15)
* `lastname` - char(15)
* `age` - integer
* `gender` - char(1)
* `gpa` - double
* `id` is Primary Key

In [8]:
%%sql
CREATE TABLE students (
    id INTEGER,
    first_name CHAR(15),
    last_name CHAR(15),
    age INTEGER,
    gender CHAR(1),
    gpa DOUBLE,
    PRIMARY KEY (id)
);

SELECT * FROM students;

 * sqlite:///cssys.db
Done.
Done.

[]

1.3 (1 point) Create a table  named `courses`

Please create a table named `courses`.
The `courses` table has four attributes: id, name, credit, pre-requisites:
* `id`- integer
* `name` - varchar(30)
* `credit` - integer
* `prereq` - integer
* (`id`, `prereq`) is Primary Key

In [34]:
%%sql
CREATE TABLE courses (
    id INTEGER,
    name VARCHAR(30),
    credit INTEGER,
    prereq INTEGER,
    PRIMARY KEY (id, prereq)
);

SELECT * FROM courses;

 * sqlite:///cssys.db
Done.
Done.

[]

1.4 (1 point) Create a table  named `transcript`

Please create a table named `transcript`.
The `transcript` table has five columns: studentid, courseid, mark, semester, credit:
* `studentid`- integer
* `courseid` - integer
* `mark` - double
* `semester` - integer (represented as `year + 01:fall, 02:spring, 03:summer`)
* `credit` - integer
* (`studentid`,`courseid`) is Primary Key

In [35]:
%%sql
CREATE TABLE transcript (
    student_id INTEGER,
    course_id INTEGER,
    mark DOUBLE,
    semester INTEGER,
    credit INTEGER,
    PRIMARY KEY (student_id, course_id)
);

SELECT * FROM transcript;

 * sqlite:///cssys.db
Done.
Done.

[]

## Q2: Modify a database (1 point)

Please write SQL queries replace the age attribute with a Date of Birth (dob) attribute to table `students`. Please decide on the type and the default value of this attribute and include it in your response. You should decide on how to perform this step (delete/recreate/modify).

## Q3: Add data to a database (3 points)

3.1 (1 point) Add rows to `students`.

Please write SQL queries to insert the following rows to the `students` table. Change the format of date of birth attribute value based on your definition of its type.
```
1001, adam, smith, 2000-01-03, m, 3.1
1002, alice, frank, 1999-03-11, f , 3.4
1003, bob, hal, 1999-09-01, m, 2
```

In [ ]:
#REPLACE WITH YOUR CODE#

3.2 (1 point) Add rows to `courses`.

Please write SQL queries to insert the following rows to the `courses` table.
```
100, programming, 3, NULL
110, math, 3, NULL
120, web, 4, NULL
301, networking, 4, 200
301, networking, 4, 150
301, networking, 4, 210
354, database, 3, 120
354, database, 3, 110
360, os, 3, 150
360, os, 3, 210
```

In [ ]:
#REPLACE WITH YOUR CODE#

3.3 (1 point) Add rows to `transcript`.

Please write SQL queries to insert the following rows to the `transcript` table.
```
1001, 100, 3, 202201, 3
1001, 110, 3.5, 202201, 3
1001, 120, 2.7, 202201, 4
1001, 301, 3.4, 202202, 4
1002, 100, 3, 201801, 3
1002, 110, 3.2, 202301, 3
1002, 301, 3.1, 202302, 4
1003, 100, 2.5, 202201, 3
1003, 120, 3.5, 202301, 4
1003, 301, 2.8, 202302, 4
1003, 354, 4, 202303, 3
1003, 360, 3.5, 202202, 3

```

In [ ]:
#REPLACE WITH YOUR CODE#

## Q4: Query a database (10 points)

Please write the SQL query for each of the requests below.

4.1 (1 point) Please write a SQL query to show all rows in the `students` table.

In [ ]:
#REPLACE WITH YOUR CODE#

4.2 (1 point) Please write a SQL query to show the rows whose `credit` is `3` in the `courses` table.

In [ ]:
#REPLACE WITH YOUR CODE#

4.3 (1 point) Please write a SQL query to show the rows whose `mark` is larger than 3 and `credit` is no smaller than 3 in the `transcript` table.

In [ ]:
#REPLACE WITH YOUR CODE#

4.4 (1 point) Please write a SQL query to show `studentid`, `courseid` and `mark` of all rows in the `transcript` table.

In [ ]:
#REPLACE WITH YOUR CODE#

4.5 (1 point) Please write a SQL query to show `studentid`, `courseid` and `mark` of all rows in the `transcript` table whose semester value is `202302`.

In [ ]:
#REPLACE WITH YOUR CODE#

4.6 (1 point) Please write a SQL query to show _distinct_ `courseid` of all rows in the `transcript` table.

In [ ]:
#REPLACE WITH YOUR CODE#

4.7 (1 point) Please write a SQL query to show the `firstname` and `lastname` and `gpa` from `students` table and sort it based on `gpa`.

In [ ]:
#REPLACE WITH YOUR CODE#

4.8 (3 points) Please write a SQL query to compute `lettergrade` of each row in the `transcript` table, and show `studentid`, `courseid` and `lettergrade` of all rows in the `transcript` table. `lettergrade` is computed as follows: 

* If `mark` >= 3.5, then `lettergrade` = "A"
* If 3 <= `mark` < 3.5, then `lettergrade` = "B"
* If 2.5 <= `mark` < 3, then `lettergrade` = "C"
* If 2 <= `mark` < 2.5, then `lettergrade` = "D"
* If `mark` < 2, then `lettergrade` = "F"

In [ ]:
#REPLACE WITH YOUR CODE#

## Q5: Load & Query a database (7 points)

Suppose you work at a bank as a data analyst. Your main job is to analyze the data stored in their database to find out information that can help the business. Please download the database at this [link](bank.db).

The database has six tables. The following shows their schemas. Primary key attributes are underlined and foreign keys are noted in superscript.
 - Customer = {<span style="text-decoration:underline">customerID</span>, firstName, lastName, income, birthDate}
 - Account = {<span style="text-decoration:underline">accNumber</span>, type, balance, branchNumber<sup>FK-Branch</sup>}
 - Owns = {<span style="text-decoration:underline">customerID</span><sup>FK-Customer</sup>, <span style="text-decoration:underline">accNumber</span><sup>FK-Account</sup>}
 - Transactions = {<span style="text-decoration:underline">transNumber</span>, <span style="text-decoration:underline">accNumber</span><sup>FK-Account</sup>, amount}
 - Employee = {<span style="text-decoration:underline">sin</span>, firstName, lastName, salary, branchNumber<sup>FK-Branch</sup>}
 - Branch = {<span style="text-decoration:underline">branchNumber</span>, branchName, managerSIN<sup>FK-Employee</sup>, budget}

Please run the next cell after downloading the database, before you start.

In [ ]:
%sql sqlite:///bank.db

5.1 (1 point) Suppose you talked with a customer, you remember their name started with 'M', included an 'r' and finished with an 'a', but you are not sure about the complete spelling. Please write a SQL query to show the first name and last name of the customers with such first name.

In [ ]:
#REPLACE WITH YOUR CODE

5.2 (1 point) Please write a SQL query to show names of the branches and first name and last name of their managers.

In [ ]:
#REPLACE WITH YOUR CODE

5.3 (1 point) Please write a SQL query to find out employees who are also customers (assume all names are unique).

In [ ]:
#REPLACE WITH YOUR CODE

5.4 (2 points) Please write a SQL query to show account number, account type, account balance, and transaction amount of the accounts with balance higher than 100,000 and transaction amouns higher than 15000, starting with the accounts with the highest transaction amount and highest account balance.

In [ ]:
#REPLACE WITH YOUR CODE

5.5 (2 points) Please write a SQL query to find the customer ID, first name, and last name of customers who own accounts at London and Berlin branches, order by last name and first name.

In [ ]:
#REPLACE WITH YOUR CODE

## Submission

Complete the code in this notebook, and submit it to through Canvas system to your Homework 1 activity.